# BLEEP이란?
BLEEP(Blockchain Emulation and Evaluation Platform)은 블록체인을 개발 및 테스팅하는 플랫폼이다.
- 실제 블록체인 바이너리를 실행시켜 동작을 검증할 수 있으며 네트워크 토폴로지 구축 및 환경설정이 가능하다.
- 시뮬레이션된 네트워크와 운영체제를 사용함으로써 격리된 환경에서 일관된 동작과 결과를 보장하고,
- 일반적인 컨테이너 기반 가상화보다 비용효율적인 테스팅이 가능하다.
- 또한, BLEEP이 제공하는 다양한 테스트케이스를 통해 블록체인 구현체의 동작과 안정성을 검증할 수 있고
- 블록체인 구현을 위해 BLEEP에서 제공하는 모듈형 라이브러리를 이용할 수 있다. 

현재 C/C++ 기반의 블록체인을 에뮬레이션할 수 있고 블록체인 개발에 필요한 모듈형 라이브러리와 간단한 테스팅 환경을 제공한다.

# Goal 
비용효율적인 블록체인 개발 및 테스트환경을 제공하는 플랫폼을 구축하는것이 목표이며,<br> 
블록체인의 범위는 현재 C/C++기반 블록체인 기반기술을 대상으로 하며, 향후에는 다양한 언어로 구현된 블록체인과<br> 
이를 이용하는 어플리케이션까지 확장하고자 한다.<br>  
이를위해 BLEEP은 다음과 같은 3가지의 핵심 목표를 추구한다.
- 개발자를 위한 블록체인 모듈형 라이브러리 및 인터페이스 제공
- 다양한 언어로 구현된 블록체인 바이너리의 동작을 에뮬레이션
- 블록체인 동작 검증을 위한 기능 및 성능, 취약성 등의 테스팅 환경 제공

# Current Status
현재 우리의 주요 성과는 아래와 같다.  
- 블록체인 모듈형 라이브러리 및 인터페이스 제공
  - 저수준의 소켓 처리를 위한 소켓 레이어 API
  - 고수준의 P2P통신을 P2P 레이어 API
  - P2P 멤버십 프로토콜(HyParView) API
  - 가십 프로토콜(PlumTree) API
- 에뮬레이션 가능한 블록체인 목록
  - BITCOIN
- 블록체인 동작 및 성능 검증, 취약성 테스팅 등을 위한 환경 제공  
  - (성능) BLEEP 프로파일링 툴을 이용한 블록체인 성능 분석 가능
  - (성능) TPS, Latency, Throughput 등 측정 가능  
  - (성능) 블록체인 스토리지 파일 공유를 통한 디스크 부하 개선 가능 
  - (디버깅) 에뮬레이션 결과를 바탕으로 네트워크 프로토콜(헤더, 바디) 분석 가능
  - (취약성) P2P 취약점을 이용한 Erebus Attack 검증
  - (확장성) 1000개 이상의 블록체인 노드 동작 검증
- 기타 
  - 블록체인 성능 분석을 위한 프로파일링 모듈 지원
  - 블록체인 스토리지 공유를 위한 파일 공유 모듈 지원

그리고 실제 KAIST 대학원 수업과정에 BLEEP을 이용해 실습을 진행한 바 있다. 

# BLEEP Design
BLEEP은 일반적인 프로젝트 수행 방법론을 "개발-테스트 및 배포-실행-결과"의 4단계를 통해 준수할 수 있도록 설계 되었다.<br> 
구현 및 테스팅을 위한 라이브러리 인터페이스와 대시보드 인터페이스가 있으며, 로깅 작업을 통해 결과를 저장 및 출력(시각화 등)할 수 있도록 설계 하였다. 

주요 컴포넌트들은 다음과 같다. 
- Shadow : Shadow는 Tor 네트워크의 동작을 시뮬레이션 하기 위한 오픈 프로젝트이며, BLEEP팀은 Shadow를 기반으로 블록체인의 에뮬레이션 환경을 제공
- BLEEPlib : 개발 및 테스팅을 위한 라이브러리 제공
- external : 테스팅 대상이되는 블록체인 및 블록체인이 의존하는 커스텀 라이브러리를 제공
- testlibs : 테스팅을 위해 필요한 스크립트 및 라이브러리 제공
- tests : 블록체인의 동작을 테스팅하기 위한 다양한 테스트케이스 제공

![BLEEP Architecture](https://github.com/kaistshadow/blockchain-sim/blob/feature/191/documentation/doc/images/BLEEP_Architecture.png)

# Install & Build
bleep 을 설치하는 과정은 다음과 같다. 
```
git clone https://github.com/kaistshadow/blockchain-sim
cd blockchain-sim
python setup.py --all
source ~/.bashrc
```
setup.py 옵션에는 3가지가 있다. 
* --all: 전체 빌드 
* --bitcoin: bitcoin만 빌드 
* --test: regtest 빌드 및 실행 

# Release
* Release 0.1.0 (March,2021) - 단일 노드의 비트코인 에뮬레이션 및 erebus attack test 지원
* Release 0.2.0 (March,2021) - 멀티 노드의 비트코인 에뮬레이션 지원 (예정)
